#Область ПрограммныйИнтерфейс

// Возвращает параметры регистрации внешней обработки для подсистемы "Дополнительные отчеты и обработки"
//
// Возвращаемое значение:
//   Структура - см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке()
Функция СведенияОВнешнейОбработке() Экспорт
	Сведения = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	Сведения.Наименование = Метаданные().Синоним;
	Сведения.Версия =  "2.0.0.7";
	Сведения.Вид = "ДополнительнаяОбработка";
	Возврат Сведения;
КонецФункции

#КонецОбласти